Repository: giellalt/corpus-sme
Catalog: prestable/tmx/eng/facta/giellatekno/oahpaheaddji.sme.html.tmx
Source language: sme
Languages: eng

source: Oahpaheaddjái
eng: For teachers

source: Ruoktot
eng: Home in English

source: Dás leat liŋkkat davvisámegiela oahpaheddjiide.
eng: Here are relevant links for teachers teaching North Saami.

source: OAHPA-davvi - Interaktiivalaš prográmmat maiguin sáhttá hárjehallat sániid ja grammatihka.
eng: OAHPA-davvi - Interactive programs for training words and grammar

source: Oahpa giela (Kursa) - oahppanbálgát universitehta studeanttaide geat leat oahpahallame sámegiela, muhto bálgát sáhttet heivet earáide maiddái.
eng: Oahpa giela (Kursa) - course paths for university students learning North Saami.

source: Jietnafiillat ja liŋkkat hárjehusaide. Čilgehusat leat dáro- ja sámegillii.
eng: Explanations are in Norwegian and Saami, and one path has explanations in Finnish.

source: Ovtta bálgás leat čilgehusat suomagillii.
eng: Audiofiles and links to exercises.

source: Grammatihkka sihke dárogillii, sámegillii ja eŋgelasgillii
eng: Grammar, also in English

source: Sániid sojahanminstarat - Dihtor sojaha sáni maid háliidat
eng: Paradigms - Tool for word inflection

source: Neahttadigisánit: sámi-dáru ja dáru-sámi.
eng: Neahttadigisánit – Saami-Norwegian and Norwegian-Saami online dictionary Understands inflected wordsOffers inflection paradigms.

source: Doaibmá dušše go lea interneahttaoktavuohta.
eng: Linked to corpus search.

source: Sátnegirji ipmirda sojahuvvon sániid ja čajeha mo sátni sojahuvvo.
eng: With a bookmarklet: click a word in a text to get it translated.

source: Liŋkkain beassá oaidnit mo sátni geavahuvvo teavsttain.
eng: Linked to corpus search.

source: Girjemearka / favorihta-fálu bokte prográmma jorgala sániid go coahkkala daid.
eng: With a bookmarklet: click a word in a text to get it translated.

source: Webdict: sámi-dáru ja dáru-sámi.
eng: Webdict: Saami-Norwegian and Norwegian-Saami online dictionary.

source: Čájeha sániid listun, juoga mii sáhttá leat ávkin jus ii dieđe mo sátni čállojuvvo.
eng: The words are presented as a list, which can be useful if you don ' t know how to spell the word.

source: Dušše vuođđohámit.
eng: Only baseforms.

source: Eanet davvisámi sátnegirjjit
eng: More dictionaries

source: Korpus ohcan – oza sániid teakstačoakkáldagas
eng: Corpus search – look up words in texts

source: GEO - báikenamat gielas gillii
eng: GEO - place names from language to language

source: Dás lea sajáiduhttinlistu skuvlla dihtorovddasvástideaddji várás.
eng: Her en installing list for the IT-workers at school.
